results/mpi_benchmark/sysbench_fio/fio_cephfs/oc_sys-fio_cephfs.worker05_1threads.4/stdout
sysbench 1.0.17 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     516.35
    fsyncs/s:                     668.07

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               8.07

General statistics:
    total time:                          10.0696s
    total number of events:              11800

Latency (ms):
         min:                                    0.00
         avg:                                    0.85
         max:                                    7.80
         95th percentile:                        2.97
         sum:                                 9990.57

Threads fairness:
    events (avg/stddev):           11800.0000/0.00
    execution time (avg/stddev):   9.9906/0.00

sysbench 1.0.17 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random read test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      1011.20
    writes/s:                     0.00
    fsyncs/s:                     0.00

Throughput:
    read, MiB/s:                  15.80
    written, MiB/s:               0.00

General statistics:
    total time:                          10.0008s
    total number of events:              10114

Latency (ms):
         min:                                    0.00
         avg:                                    0.99
         max:                                    5.32
         95th percentile:                        1.52
         sum:                                 9984.08

Threads fairness:
    events (avg/stddev):           10114.0000/0.00
    execution time (avg/stddev):   9.9841/0.00

DONE